// // Написать программу, 
// которая из имеющегося массива строк 
// формирует массив из строк длина которых 
// меньше либо равна 3 символа.
Console.WriteLine("Hello, World!");
